c/bin/oraccnet/soap/ows/ows.call.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
  xmlns:ows="http://oracc.org/ws/ows">
 <SOAP-ENV:Body>
  <ows:Data xmime5:contentType="">
   <xop:Include></xop:Include>
  </ows:Data>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
